test/testdata/1_created_subscription/invoice.paid.json

{
    "id": "evt_1I2mb1HMtY1VBRBjSf0LBu6X",
    "object": "event",
    "api_version": "2020-08-27",
    "created": 1609026891,
    "data": {
        "object": {
            "id": "in_1I2mazHMtY1VBRBjLjsN0jP4",
            "object": "invoice",
            "account_country": "US",
            "account_name": "MonitoRSS",
            "account_tax_ids": null,
            "amount_due": 100,
            "amount_paid": 100,
            "amount_remaining": 0,
            "application_fee_amount": null,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "billing_reason": "subscription_create",
            "charge": "ch_1I2mb0HMtY1VBRBjrZdIiGMw",
            "collection_method": "charge_automatically",
            "created": 1609026889,
            "currency": "usd",
            "custom_fields": null,
            "customer": "cus_Ie4CO87cWz9h1Q",
            "customer_address": null,
            "customer_email": "ddd@gmail.com",
            "customer_name": "199888253313089536",
            "customer_phone": null,
            "customer_shipping": null,
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "ending_balance": 0,
            "footer": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1HqNwfHMtY1VBRBj/invst_Ie4kexVTcTBDqASwBA2bqI6zQuCXbnG",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_1HqNwfHMtY1VBRBj/invst_Ie4kexVTcTBDqASwBA2bqI6zQuCXbnG/pdf",
            "last_finalization_error": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1I2mazHMtY1VBRBjyST9v3Y0",
                        "object": "line_item",
                        "amount": 100,
                        "currency": "usd",
                        "description": "1 \u00d7 T1 (at $1.00 / month)",
                        "discount_amounts": [],
                        "discountable": true,
                        "discounts": [],
                        "livemode": false,
                        "metadata": {},
                        "period": {
                            "end": 1611705289,
                            "start": 1609026889
                        },
                        "plan": {
                            "id": "price_1HzFETHMtY1VBRBjlvLr7h3i",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 100,
                            "amount_decimal": "100",
                            "billing_scheme": "per_unit",
                            "created": 1608183657,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {
                                "displayName": "T1 Monthly"
                            },
                            "nickname": null,
                            "product": "prod_IaQ4RRBbJDt925",
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1HzFETHMtY1VBRBjlvLr7h3i",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1608183657,
                            "currency": "usd",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {
                                "displayName": "T1 Monthly"
                            },
                            "nickname": null,
                            "product": "prod_IaQ4RRBbJDt925",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 100,
                            "unit_amount_decimal": "100"
                        },
                        "proration": false,
                        "quantity": 1,
                        "subscription": "sub_Ie4kFfwdRqefV3",
                        "subscription_item": "si_Ie4koYn7dTsaRY",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "subscription"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_1I2mazHMtY1VBRBjLjsN0jP4/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "DC6F2F6E-0002",
            "paid": true,
            "payment_intent": "pi_1I2mazHMtY1VBRBjIeR0DAMQ",
            "period_end": 1609026889,
            "period_start": 1609026889,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "receipt_number": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1609026889,
                "marked_uncollectible_at": null,
                "paid_at": 1609026891,
                "voided_at": null
            },
            "subscription": "sub_Ie4kFfwdRqefV3",
            "subtotal": 100,
            "tax": null,
            "total": 100,
            "total_discount_amounts": [],
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1609026889
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_ciTuD82pAkBr1g",
        "idempotency_key": null
    },
    "type": "invoice.paid"
}