test/testdata/2a_updated_subscription_higher/invoice.paid.json

{
    "id": "evt_1I2n8nHMtY1VBRBjOuDZ0BwB",
    "object": "event",
    "api_version": "2020-08-27",
    "created": 1609028985,
    "data": {
        "object": {
            "id": "in_1I2n8lHMtY1VBRBjj6MSfXZc",
            "object": "invoice",
            "account_country": "US",
            "account_name": "MonitoRSS",
            "account_tax_ids": null,
            "amount_due": 150,
            "amount_paid": 150,
            "amount_remaining": 0,
            "application_fee_amount": null,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "billing_reason": "subscription_update",
            "charge": "ch_1I2n8mHMtY1VBRBjYRAmO0U6",
            "collection_method": "charge_automatically",
            "created": 1609028983,
            "currency": "usd",
            "custom_fields": null,
            "customer": "cus_Ie4CO87cWz9h1Q",
            "customer_address": null,
            "customer_email": "ddd@gmail.com",
            "customer_name": "199888253313089536",
            "customer_phone": null,
            "customer_shipping": null,
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "ending_balance": 0,
            "footer": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1HqNwfHMtY1VBRBj/invst_Ie5JkPKt5p9ALCLNvGgAIBS3tbp7ymF",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_1HqNwfHMtY1VBRBj/invst_Ie5JkPKt5p9ALCLNvGgAIBS3tbp7ymF/pdf",
            "last_finalization_error": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1I2n8lHMtY1VBRBjqYPWvXCZ",
                        "object": "line_item",
                        "amount": -100,
                        "currency": "usd",
                        "description": "Unused time on T1 after 27 Dec 2020",
                        "discount_amounts": [],
                        "discountable": false,
                        "discounts": [],
                        "invoice_item": "ii_1I2n8lHMtY1VBRBjA39v6mEO",
                        "livemode": false,
                        "metadata": {},
                        "period": {
                            "end": 1611703289,
                            "start": 1609028944
                        },
                        "plan": {
                            "id": "price_1HzFETHMtY1VBRBjlvLr7h3i",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 100,
                            "amount_decimal": "100",
                            "billing_scheme": "per_unit",
                            "created": 1608183657,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {
                                "displayName": "T1 Monthly"
                            },
                            "nickname": null,
                            "product": "prod_IaQ4RRBbJDt925",
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1HzFETHMtY1VBRBjlvLr7h3i",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1608183657,
                            "currency": "usd",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {
                                "displayName": "T1 Monthly"
                            },
                            "nickname": null,
                            "product": "prod_IaQ4RRBbJDt925",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 100,
                            "unit_amount_decimal": "100"
                        },
                        "proration": true,
                        "quantity": 1,
                        "subscription": "sub_Ie4DhJ2wsqY1Nb",
                        "subscription_item": "si_Ie4DgTQHJdOwuY",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "invoiceitem"
                    },
                    {
                        "id": "il_1I2n8lHMtY1VBRBjPskcrm9r",
                        "object": "line_item",
                        "amount": 250,
                        "currency": "usd",
                        "description": "Remaining time on T2 after 27 Dec 2020",
                        "discount_amounts": [],
                        "discountable": false,
                        "discounts": [],
                        "invoice_item": "ii_1I2n8lHMtY1VBRBjmC6RyG7B",
                        "livemode": false,
                        "metadata": {},
                        "period": {
                            "end": 1611703289,
                            "start": 1609028944
                        },
                        "plan": {
                            "id": "price_1HzFFBHMtY1VBRBjzTjgYwiB",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 250,
                            "amount_decimal": "250",
                            "billing_scheme": "per_unit",
                            "created": 1608183701,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_IaQ5EOZgD85tjY",
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1HzFFBHMtY1VBRBjzTjgYwiB",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1608183701,
                            "currency": "usd",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_IaQ5EOZgD85tjY",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 250,
                            "unit_amount_decimal": "250"
                        },
                        "proration": true,
                        "quantity": 1,
                        "subscription": "sub_Ie4DhJ2wsqY1Nb",
                        "subscription_item": "si_Ie4DgTQHJdOwuY",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "invoiceitem"
                    }
                ],
                "has_more": false,
                "total_count": 2,
                "url": "/v1/invoices/in_1I2n8lHMtY1VBRBjj6MSfXZc/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "DC6F2F6E-0003",
            "paid": true,
            "payment_intent": "pi_1I2n8lHMtY1VBRBjeUFzjRe0",
            "period_end": 1609028983,
            "period_start": 1609024889,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "receipt_number": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1609028983,
                "marked_uncollectible_at": null,
                "paid_at": 1609028983,
                "voided_at": null
            },
            "subscription": "sub_Ie4DhJ2wsqY1Nb",
            "subtotal": 150,
            "tax": null,
            "total": 150,
            "total_discount_amounts": [],
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1609028983
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": null,
        "idempotency_key": null
    },
    "type": "invoice.paid"
}