test/testdata/5_renewed_subscription/invoice.paid.json

{
    "id": "evt_1I3mt4HMtY1VBRBjIeDZS6Kc",
    "object": "event",
    "api_version": "2020-08-27",
    "created": 1609266338,
    "data": {
        "object": {
            "id": "in_1I3lwRHMtY1VBRBj3nyGK7C8",
            "object": "invoice",
            "account_country": "US",
            "account_name": "MonitoRSS",
            "account_tax_ids": null,
            "amount_due": 0,
            "amount_paid": 100,
            "amount_remaining": 0,
            "application_fee_amount": null,
            "attempt_count": 0,
            "attempted": true,
            "auto_advance": false,
            "billing_reason": "subscription_cycle",
            "charge": null,
            "collection_method": "charge_automatically",
            "created": 1609262703,
            "currency": "usd",
            "custom_fields": null,
            "customer": "cus_Idfg51ci8idExm",
            "customer_address": null,
            "customer_email": "michael994664@gmail.com",
            "customer_name": "199888253313089536",
            "customer_phone": null,
            "customer_shipping": null,
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "ending_balance": -99999395,
            "footer": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1HqNwfHMtY1VBRBj/invst_If68yx4B0You75zDkeS21ELVIoIZeIl",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_1HqNwfHMtY1VBRBj/invst_If68yx4B0You75zDkeS21ELVIoIZeIl/pdf",
            "last_finalization_error": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1I3lwRHMtY1VBRBjWUzav7iG",
                        "object": "line_item",
                        "amount": 100,
                        "currency": "usd",
                        "description": "1 × T1-2 (at $1.00 / day)",
                        "discount_amounts": [],
                        "discountable": true,
                        "discounts": [],
                        "livemode": false,
                        "metadata": {},
                        "period": {
                            "end": 1609349098,
                            "start": 1609262698
                        },
                        "plan": {
                            "id": "price_1I32xfHMtY1VBRBjV42XPGUX",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 100,
                            "amount_decimal": "100",
                            "billing_scheme": "per_unit",
                            "created": 1609089799,
                            "currency": "usd",
                            "interval": "day",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": "daily-charge",
                            "product": "prod_Ie71Hw2yhBDWjf",
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1I32xfHMtY1VBRBjV42XPGUX",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1609089799,
                            "currency": "usd",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": "daily-charge",
                            "product": "prod_Ie71Hw2yhBDWjf",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "day",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 100,
                            "unit_amount_decimal": "100"
                        },
                        "proration": false,
                        "quantity": 1,
                        "subscription": "sub_IdjCtwSwGBPo5s",
                        "subscription_item": "si_IdjC38KCsNxxCb",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "subscription"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_1I3lwRHMtY1VBRBj3nyGK7C8/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "7CA5310D-0008",
            "paid": true,
            "payment_intent": null,
            "period_end": 1609262698,
            "period_start": 1609176298,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "receipt_number": null,
            "starting_balance": -99999495,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1609266338,
                "marked_uncollectible_at": null,
                "paid_at": 1609266338,
                "voided_at": null
            },
            "subscription": "sub_IdjCtwSwGBPo5s",
            "subtotal": 100,
            "tax": null,
            "total": 100,
            "total_discount_amounts": [],
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1609262703
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": null,
        "idempotency_key": null
    },
    "type": "invoice.paid"
}