test/testdata/6_subscription_deleted/customer.subscription.deleted.json

{
    "created": 1326853478,
    "livemode": false,
    "id": "evt_00000000000000",
    "type": "customer.subscription.deleted",
    "object": "event",
    "request": null,
    "pending_webhooks": 1,
    "api_version": "2020-08-27",
    "data": {
        "object": {
            "id": "sub_00000000000000",
            "object": "subscription",
            "application_fee_percent": null,
            "billing_cycle_anchor": 1608177591,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": 1608183562,
            "collection_method": "charge_automatically",
            "created": 1608177591,
            "current_period_end": 1610855991,
            "current_period_start": 1608177591,
            "customer": "cus_00000000000000",
            "days_until_due": null,
            "default_payment_method": "pm_1HzDecHMtY1VBRBjUW4GpDq2",
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": 1609478076,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_00000000000000",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1608177591,
                        "metadata": {},
                        "price": {
                            "id": "price_00000000000000",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1606072274,
                            "currency": "usd",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": "T2",
                            "product": "prod_00000000000000",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "usage_type": "licensed"
                            },
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 1000,
                            "unit_amount_decimal": "1000"
                        },
                        "quantity": 1,
                        "subscription": "sub_00000000000000",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "url": "/v1/subscription_items?subscription=sub_IaORaIkG64Dp4E"
            },
            "latest_invoice": "in_1HzDedHMtY1VBRBj68ZcyZCW",
            "livemode": false,
            "metadata": {},
            "next_pending_invoice_item_invoice": null,
            "pause_collection": null,
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "schedule": null,
            "start_date": 1608177591,
            "status": "canceled",
            "transfer_data": null,
            "trial_end": null,
            "trial_start": null
        }
    }
}